            Dcl-s anumber int(5);

            anumber = 5;

            if (anumber = 10);
               dsply 'The number is 10!';
            else;
               if (anumber = 5);
                 dsply 'The number is 5';
               else;
                 dsply 'The number is not 5';
               endif;
            endif;

            Return;
